# -*- coding: utf-8 -*-
import sys
print sys.path

from django.core.management.base import BaseCommand, CommandError
from django.contrib.auth.models import Group, Permission
from django.conf import settings


from dailyreport.models import *



class Command(BaseCommand):
    help = 'set holiday memo'


    def handle(self, *args, **kw):
        data = [
            ["2017-09-11", u"", u"", u"", u"1.交通安全設施(交通錐及連桿.活動型紐澤西護欄.警示燈及警示帶.蜂鳴器)查驗\n2.環境保護設施(移動式車輛沖洗設備)查驗\n3.勞工安全衛生設備(給水設備.救生衣.救生圈.救生船.安全帽.急救箱.紅色三角施)查驗"],
            ["2017-09-12", u"", u"", u"1.停工\n2.轉呈部份驗收結算資料(旭城工設字第1060003371號函)\n3.承商函文派員會同進行水深查驗(威工字第106091101號函)", u""],
            ["2017-09-13", u"", u"", u"1.停工\n2.貴府檢還8月份工日誌及監造報表(106.9.11府農漁字第1060180880號函)", u""],
            ["2017-09-14", u"", u"", u"1.停工\n2.106.9.12貴府函知訂於106.9.15上午10時辦理工程督導(府農漁字第1060181508號函)", u""],
            ["2017-09-15", u"", u"", u"1.停工\n2.函文回覆　貴府8月份施工日誌及監造報表進度不一說明(旭城工設字第1060003424號函)\n3.承商函文提出因高程差異申報自106.9.11起辦理停工(威工字第106091501號函)", u""],
            ["2017-09-16", u"", u"", u"1.停工", u""],
            ["2017-09-17", u"", u"", u"1.停工", u""],
            ["2017-09-18", u"", u"", u"1.停工\n2.檢送1060906會議紀錄(旭城工設字第1060003430號函)", u""],
            ["2017-09-19", u"", u"", u"1.停工\n2.函轉　貴府106.9.11申報停工(旭城工設字第1060003443號函)\n3.106.9.18 貴府函知預算書編碼不足案依工程會意見辦理(府農漁字第1060188120號函)\n4.106.9.14 工程會函知預算書編碼正確率不足案應落實辦理(工程技字第1060284380號函)", u""],
            ["2017-09-20", u"", u"", u"1.停工\n2.轉呈8月份施工日誌(旭城工設字第1060003450號函)\n3.轉呈趕工計畫(旭城工設字第1060003451號函)\n4.106.9.19承商提送8月份施工日誌(威工字第106091901號函)\n5.106.9.19承商提送趕工計畫(威工字第106091902號函)", u""],
            ["2017-09-21", u"", u"", u"1.停工", u""],
            ["2017-09-22", u"", u"", u"1.停工\n2.函催承商提送1060915工程督導缺失(旭城工設字第1060003466號函)\n3.貴府函知依106.9.6工程會議紀錄辦理(府農漁字第1060190731號函)\n4.貴府函文檢送106.9.15工程督導紀錄(府農漁字第1060190473號函)", u""],
            ["2017-09-23", u"", u"", u"1.停工", u""],
            ["2017-09-24", u"", u"", u"1.停工", u""],
            ["2017-09-25", u"", u"", u"1.停工", u""],
            ["2017-09-26", u"", u"", u"1.停工\n2.106.9.22承商申請106.9.11停工案,貴府同意辦理(府農漁字第1060191622號函)", u""],
            ["2017-09-27", u"", u"", u"1.停工\n2.函催承商提送浚前測量佐證資料(旭城工設字第1060003493號函)\n3.106.9.21 貴府檢還趕工計畫(府農漁字第1060191732號函)", u""],
            ["2017-09-28", u"", u"", u"1.停工", u""],
            ["2017-09-29", u"", u"", u"1.停工", u""],
            ["2017-09-30", u"", u"", u"1.停工\n2.函催承商提送趕工計畫(旭城工設字第1060003506號函)\n3.函催承商提送測量佐證資料(旭城工設字第1060003507號函)\n4.函文要求承停止逕行施作(旭城工設字第1060003511號函)", u""],
            ["2017-10-01", u"", u"", u"1.停工", u""],
            ["2017-10-02", u"", u"", u"1.停工", u""],
            ["2017-10-03", u"", u"", u"1.停工\n2.檢送9月份監造報表(旭城工設字第1060003537號函)\n3.承商提送9月份施工日誌(威工字第106100303號函)\n4.承商提送第二次修正趕工計畫書(威工字第106100302號函)\n5.承商提送修正後浚前測量報告書(威工字第106100301號函)\n6.106年8月份施工日誌及監造報表同意核備(106.9.28府農漁字第1060188329號函)", u""],
            ["2017-10-04", u"", u"", u"1.停工", u""],
            ["2017-10-05", u"", u"", u"1.停工", u""],
            ["2017-10-06", u"", u"", u"1.函文　貴府更換監造人員(旭城工設字第1060003585號函)", u""],
            ["2017-10-07", u"", u"", u"", u""],
            ["2017-10-08", u"", u"", u"1.停工", u""],
            ["2017-10-09", u"", u"", u"1.停工", u""],
            ["2017-10-10", u"", u"", u"1.停工", u""],
            ["2017-10-11", u"", u"", u"1.停工", u""],
            ["2017-10-12", u"", u"", u"1.停工\n2.貴府函文同意變更監造現場品管人員(府農漁字第1060205096號函)", u""],
            ["2017-10-13", u"", u"", u"1.停工\n2.函文邀集三方會同漁會漁民於106.10.16召開施工協調會(旭城工設字第1060003617號函)\n3.106年9月份施工日誌及監造報表同意核備(106.10.13府農漁字第1060202855號函)", u""],
            ["2017-10-14", u"", u"", u"1.停工", u""],
            ["2017-10-15", u"", u"", u"1.停工", u""],
            ["2017-10-16", u"", u"", u"1.停工\n2.三方會同當地漁會及漁民召開施工協調會", u""],
            ["2017-10-17", u"", u"", u"1.停工", u""],
            ["2017-10-18", u"", u"", u"1.停工", u""],
            ["2017-10-19", u"", u"", u"1.停工", u""],
            ["2017-10-20", u"", u"", u"1.停工\n2.轉呈趕工計畫書及測量報告書(旭城工設字第1060003669號函)", u""],
            ["2017-10-21", u"", u"", u"1.停工", u""],
            ["2017-10-22", u"", u"", u"1.停工", u""],
            ["2017-10-23", u"", u"", u"1.停工", u""],
            ["2017-10-24", u"", u"", u"1.停工", u""],
            ["2017-10-25", u"", u"", u"1.停工\n2.接獲 貴開會通知單於106.10.26召開施工協調會", u""],
            ["2017-10-26", u"", u"", u"1.停工\n2.三方會同工程施工協調會", u""],
            ["2017-10-27", u"", u"", u"1.停工\n2.貴府函文檢還測量報告書及趕工計畫書(106.10.25府農漁字第1060213078號函)", u""],
            ["2017-10-28", u"", u"", u"1.停工", u""],
            ["2017-10-29", u"", u"", u"1.停工", u""],
            ["2017-10-30", u"", u"", u"1.停工\n2.函文邀集三方會同辦理航道及填築區現況收測(旭城工設字第1060003729號函)", u""],
            ["2017-10-31", u"", u"", u"1.停工", u""],
            ["2017-11-01", u"", u"", u"1.貴府檢送106.10.26工程協調會紀錄(106.10.31府農漁字第1060218531號)", u""],
            ["2017-11-02", u"", u"", u"1.三方會同測量人員進行布袋漁港航道及填築區複測", u""],
            ["2017-11-03", u"", u"", u"1.檢送106年10月份監造報表(旭城工設字第1060003769號)\n2.函催106年10月份施工日誌(旭城工設字第1060003786號)\n3.轉呈106年10月份施工日誌(旭城工設字第1060003796號)\n4.檢送106年10月份施工日誌(威工字第106110301號)", u""],
            ["2017-11-04", u"", u"", u"", u""],
            ["2017-11-05", u"", u"", u"", u""],
            ["2017-11-06", u"", u"", u"", u""],
            ["2017-11-07", u"", u"", u"", u""],
            ["2017-11-08", u"", u"", u"", u""],
            ["2017-11-09", u"", u"", u"1.函催承商覆蓋防塵網(旭城工設字第1060003860號)", u""],
            ["2017-11-10", u"", u"", u"", u""],
            ["2017-11-11", u"", u"", u"", u""],
            ["2017-11-12", u"", u"", u"", u""],
            ["2017-11-13", u"", u"", u"", u""],
            ["2017-11-14", u"", u"", u"1.函催承商覆蓋防塵網(旭城工設字第1060003891號)", u""],
            ["2017-11-15", u"", u"", u"", u""],
            ["2017-11-16", u"", u"", u"1.貴府函催承商施作防塵網(府農漁字第1060230486號)", u""],
            ["2017-11-17", u"", u"", u"", u""],
            ["2017-11-18", u"", u"", u"", u""],
            ["2017-11-19", u"", u"", u"", u""],
            ["2017-11-20", u"", u"", u"", u""],
            ["2017-11-21", u"", u"", u"1.函催承商提送覆蓋防塵網改善成果(旭城工設字第1060003966號)\n2.貴府同意核備106年10月份施工日誌及監造報表(106.11.16府農漁字第1060222722號)", u""],
            ["2017-11-22", u"", u"", u"", u""],
            ["2017-11-23", u"", u"", u"", u""],
            ["2017-11-24", u"", u"", u"", u""],
            ["2017-11-25", u"", u"", u"", u""],
            ["2017-11-26", u"", u"", u"", u""],
            ["2017-11-27", u"", u"", u"", u""],
            ["2017-11-28", u"", u"", u"1.貴府函文不同意解除本工程品管及勞安人員職務(府農漁字第1060237612號)", u""],
            ["2017-11-29", u"", u"", u"", u""],
            ["2017-11-30", u"", u"", u"", u""],
            ["2017-12-01", u"", u"", u"1.三方會同至填築區現場會勘", u""],
            ["2017-12-02", u"", u"", u"", u""],
            ["2017-12-03", u"", u"", u"", u""],
            ["2017-12-04", u"", u"", u"", u""],
            ["2017-12-05", u"", u"", u"", u""],
            ["2017-12-06", u"", u"", u"", u""],
            ["2017-12-07", u"", u"", u"", u""],
            ["2017-12-08", u"", u"", u"", u""],
            ["2017-12-09", u"", u"", u"", u""],
            ["2017-12-10", u"", u"", u"", u""],
        ]

        project = Project.objects.get(id=1773)

        for d in data:
            r = ReportHoliday.objects.get(project=project, date=d[0])
            try:
                r = ReportHoliday.objects.get(project=project, date=d[0])
            except:
                print d
                continue

            r.describe_subcontractor = d[1]
            r.sampling = d[2]
            r.notify = d[3]
            r.note = d[4]
            r.save()