# -*- coding: utf-8 -*-
from django.core.management.base import BaseCommand, CommandError
import os, datetime, decimal, random
from fishuser.models import *
from django.conf import settings
import smtplib
from email import encoders
from email.mime.application import MIMEApplication
from email.mime.multipart import MIMEMultipart
from email.mime.text import MIMEText
from email.mime.base import MIMEBase
from email.utils import COMMASPACE, formatdate
import time

def TODAY(): return datetime.date.today()

class Command(BaseCommand):
    help = u"2019-07-25 設定結案與匯入pcc_no"

    def handle(self, *args, **kw):
        finish_ids = [1767,2079,1385,1780,1781,1782,1817,1827,1845,1859,1895,1917,1924,1925,1927,1930,1931,1932,1933,1937,1949,1950,1952,1961,1978,1998,2006,2092]
        set_pcc_no_ids = [1938, "1076020"], [1498, "103317"], [2038, "1061222K"], [2039, "1061222K"], [2040, "1061222K"], [2022, "1076034"], [2020, "1076035"], [2021, "1076036"], [2017, "107AGR061"], [2018, "107AGR062"], [2029, "N107110110151"], [2030, "N107110110151"], [2034, "N107110110151"], [1874, "022-1061115"], [1942, "022-1061115"], [2130, "022-1070409-1"], [1882, "022-1070802-1"], [1990, "022-1070802-1"], [2078, "022-1071115-3"], [2163, "022-1061213-1"], [2046, "022-1071119-1"], [2131, "022-1080312-1"], [2124, "022-1080411-1"], [2123, "022-1080423-1"], [2015, "07137a"], [2112, "07137a"], [2074, "07205a"], [2158, "07205a"], [2077, "07276a"], [2165, "07276a"], [2072, "08067a"], [2162, "08067a"], [1935, "AG107031503"], [1891, "CW-1107071"], [2116, "106-0020604-009-1-1"], [1953, "106-08-02"], [2177, "106-08-02"], [1947, "1061A10064"], [1996, "1066009"], [1993, "1066036"], [2010, "106A257"], [2065, "106AGR098"], [2028, "107-02"], [2073, "1070613 "], [1968, "107-06-21"], [2012, "107-1117A-01"], [2187, "107-1117A-01"], [2011, "107-1117A-02"], [2007, "1071204B"], [2179, "1071211C"], [2005, "1071212A"], [2099, "107150310262"], [1936, "107150310337"], [2070, "107150310362"], [1967, "107150310387"], [2102, "1071A10042"], [2096, "1071A10075"], [1989, "1071A10093"], [2115, "1071A10093"], [2071, "107280"], [2157, "107280"], [2081, "107331"], [2176, "107331"], [2076, "107347"], [2173, "107347"], [2075, "107348"], [2172, "107348"], [2049, "1076001"], [2122, "1076001"], [2181, "1076001"], [2120, "1076020"], [2025, "1076027"], [2023, "1076031"], [2019, "1076032"], [2190, "1076034"], [2174, "107A177"], [2178, "107A232"], [1999, "107AGR048"], [2161, "107AGR048"], [2037, "107AGR064"], [2057, "107GC389A4"], [2145, "10805-9"], [2013, "107-1118-02"], [2118, "108150310190"], [2117, "108150310203"], [2144, "1081A10047"], [2024, "1086004"], [2149, "108AGR046"], [1972, "A10716"], [2050, "AG107031502"], [2168, "AG10704241"], [1965, "AGCO106058"], [2044, "AGCO106059"], [1979, "AGCO106060 "], [2164, "AGCO107041"], [2060, "AGCO107042"], [2183, "AGCO108010"], [1975, "C0611214-1"], [1976, "C0710319"], [2062, "C0710319"], [1983, "C0710411"], [2047, "C0710501"], [2103, "C0710926"], [2185, "C0710926"], [2091, "CW-1105045"], [2054, "CW-1107065"], [2053, "CW-1107066"], [1892, "CW-1107080"], [2055, "CW-1108025"], [1997, "FHMS05"], [2059, "FHMS1070827"], [2113, "FHMS1070827"], [1970, "FHNS1070604"], [2160, "FHNS1070604"], [2066, "KAT107011"], [2082, "N106110110158"], [2031, "N107110110149"], [2032, "N107110110149"], [2033, "N107110110149"], [1966, "tyfish1070601"], [1971, "tyfish1070602"], [1985, "tyfish1071002"]

        #設定結案
        for p_id in finish_ids:
            try:
                chase_obo = CountyChaseProjectOneByOne.objects.get(project__id=p_id)
                chase_obo.act_eng_do_closed = "2018-12-31"
                chase_obo.act_ser_acceptance_closed = "2018-12-31"
                chase_obo.save()
            except: pass

        chase = CountyChaseTime.objects.all().order_by('-id').first()
        records = chase.countychaseprojectonetomany_set.filter(project__id__in=finish_ids)
        records.delete()
        
        #設定標案編號
        for row in set_pcc_no_ids:
            p = Project.objects.get(id=row[0])
            p.pcc_no = row[1]
            p.save()

        #同步工程會
        for n, row in enumerate(set_pcc_no_ids):
            print 'sync pcc info %s / %s' % (n+1, len(set_pcc_no_ids))
            p = Project.objects.get(id=row[0])
            try:
                p.sync_pcc_info()
            except: pass
            time.sleep(10)